Revit 2026 API

# ScheduleDefinitionAddField(SchedulableField) Method

---

Adds a regular field at the end of the list.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ScheduleField AddField(
	SchedulableField schedulableField
)
```
```vb
Public Function AddField (
	schedulableField As SchedulableField
) As ScheduleField
```
```cpp
public:
ScheduleField^ AddField(
	SchedulableField^ schedulableField
)
```
```fsharp
member AddField :
        schedulableField : SchedulableField -> ScheduleField
```

#### Parameters

schedulableField SchedulableField
     A SchedulableField object representing the field.

#### Return Value

ScheduleField The new field.

| Exception | Condition |
| --- | --- |
| ArgumentException | The field specified by schedulableField may not included in this ScheduleDefinition. -or- The field specified by schedulableField is already included in this ScheduleDefinition. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ScheduleDefinition Class

AddField Overload

Autodesk.Revit.DB Namespace